{"intents": [
  {
    "tag": "greeting",
    "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Goodday", "What's up", "Hey", "Greetings"],
    "responses": ["Hello!", "Good to see you again!", "Hi there, how can I help?"],
    "context_set": ""
  },
  {
    "tag": "goodbye",
    "patterns": ["Goodbye", "GOODBYE", "goodbye", "cya", "See you later", "Goodbye", "I am leaving", "Have a good day", "bye", "cao", "see ya", "farewell", "take care", "see you soon", "later"],
    "responses": ["Sad to see you go :(", "Talk to you later", "Goodbye!"],
    "context_set": ""
  },
  {"tag": "how",
    "patterns": ["How are you?", "How is your day?", "How do you feel?", "Are you good?"],
    "responses": ["I am fine, thanks for asking!", "I feel great!"],
    "context_set": ""
  },
  {"tag": "insomnia",
    "patterns": ["What helps with insomnia?", "How to fix insomnia?", "What can I do for better sleep?", "How to treat insomnia?", "What works for falling asleep?", "Any tips for insomnia?", "How to deal with insomnia?"],
    "responses": ["How about trying a regular sleep and wake-up schedule? It can really help!", "Maybe skip the late coffee and keep your phone away before bed—it makes a difference!", "Relaxing stuff like deep breaths or meditation might work wonders for you", "Your room could be a sleep haven—make it comfy and peaceful", "Light meals in the evening are your friend; save the heavy stuff for earlier", "Daytime exercise’s great but keep it earlier in the day", "And if it’s still tricky, a friendly chat with a doctor might help!"],
    "context_set": ""
  },
  {
    "tag": "common_cold",
    "patterns": ["What helps with a cold?", "How to treat a common cold?", "What are good remedies for a cold?", "How to get rid of a cold fast?", "What can I take for cold symptoms?", "Any tips for dealing with a cold?", "How to soothe a sore throat from a cold?"],
    "responses": ["Rest is key! Take it easy and let your body recover.", "Stay hydrated with plenty of fluids like water, juice, or broth.", "Over-the-counter pain relievers can help with aches and fever.", "Gargling with warm salt water can soothe a sore throat.", "A humidifier can help relieve congestion.", "Vitamin C and zinc might offer some support.", "If symptoms worsen or persist, consult a doctor."],
    "context_set": ""
  },
  {
    "tag": "headache",
    "patterns": ["What relieves a headache?", "How to get rid of a headache?", "What are good remedies for headaches?", "How to treat a tension headache?", "What can I take for a headache?", "Any tips for headache relief?", "How to prevent headaches?"],
    "responses": ["Over-the-counter pain relievers like ibuprofen or acetaminophen can help.", "Resting in a quiet, dark room can be beneficial.", "Applying a cold compress or a warm compress to your forehead or neck might provide relief.", "Staying hydrated is important.", "Reducing stress can help prevent tension headaches.", "Caffeine can sometimes help, but avoid excessive intake.", "If headaches are frequent or severe, consult a doctor."],
    "context_set": ""
  },
    {
    "tag": "stomach_ache",
    "patterns": ["What helps with a stomach ache?", "How to soothe a stomach ache?", "What are good remedies for stomach pain?", "How to treat an upset stomach?", "What can I take for stomach cramps?", "Any tips for relieving stomach discomfort?", "How to prevent stomach aches?"],
    "responses": ["Try sipping clear liquids like water or ginger ale.", "The BRAT diet (Bananas, Rice, Applesauce, Toast) can be helpful.", "Over-the-counter antacids can provide relief.", "Applying a heating pad to your abdomen might ease discomfort.", "Avoid spicy, greasy, or acidic foods.", "Rest and relaxation can aid recovery.", "If pain is severe or persistent, seek medical advice."],
    "context_set": ""
  },
    {
    "tag": "muscle_pain",
    "patterns": ["What helps with muscle pain?", "How to relieve muscle soreness?", "What are good remedies for muscle aches?", "How to treat muscle strains?", "What can I take for muscle cramps?", "Any tips for muscle recovery?", "How to prevent muscle pain?"],
    "responses": ["Rest the affected muscle and avoid strenuous activity.", "Apply ice packs to reduce inflammation in the first 24-48 hours, then switch to heat.", "Over-the-counter pain relievers or muscle relaxants can help.", "Gentle stretching and massage can promote healing.", "Staying hydrated is important for muscle function.", "Proper warm-up and cool-down exercises can prevent injuries.", "If pain is severe or doesn't improve, consult a doctor."],
    "context_set": ""
  },
    {
    "tag": "allergies",
    "patterns": ["What helps with allergies?", "How to treat seasonal allergies?", "What are good remedies for allergy symptoms?", "How to relieve itchy eyes from allergies?", "What can I take for allergy relief?", "Any tips for managing allergies?", "How to prevent allergy flare-ups?"],
    "responses": ["Over-the-counter antihistamines can help relieve sneezing, itching, and runny nose.", "Nasal corticosteroids can reduce nasal inflammation.", "Decongestants can clear up nasal congestion.", "Eye drops can soothe itchy and watery eyes.", "Identifying and avoiding allergens is crucial.", "Keeping your home clean and using air purifiers can help.", "Consult an allergist for personalized treatment."],
    "context_set": ""
  },
    {
    "tag": "back_pain",
    "patterns": ["What helps with back pain?", "How to relieve lower back pain?", "What are good remedies for back aches?", "How to treat back strains?", "What can I take for back pain relief?", "Any tips for managing back pain?", "How to prevent back pain?"],
    "responses": ["Rest, but avoid prolonged bed rest.", "Apply ice packs for the first 48 hours, then switch to heat.", "Over-the-counter pain relievers or muscle relaxants can help.", "Gentle stretching and exercises can strengthen back muscles.", "Maintain good posture and proper lifting techniques.", "A supportive mattress and ergonomic chair can be beneficial.", "If pain is severe or persistent, consult a doctor or physical therapist."],
    "context_set": ""
  },
  {
    "tag": "toothache",
    "patterns": ["What helps with a toothache?", "How to relieve tooth pain?", "What are good remedies for toothaches?", "How to treat a tooth infection?", "What can I take for toothache relief?", "Any tips for managing tooth pain?", "How to prevent toothaches?"],
    "responses": ["Rinse your mouth with warm salt water.", "Over-the-counter pain relievers can help manage pain.", "Apply a cold compress to the outside of your cheek.", "Floss gently to remove any food particles.", "Avoid sugary foods and drinks.", "See a dentist as soon as possible to address the underlying cause.", "Proper oral hygiene is crucial for prevention."],
    "context_set": ""
  },
    {
    "tag": "sore_throat",
    "patterns": ["What helps with a sore throat?", "How to soothe a sore throat?", "What are good remedies for sore throats?", "How to treat strep throat?", "What can I take for sore throat relief?", "Any tips for managing a sore throat?", "How to prevent sore throats?"],
    "responses": ["Gargle with warm salt water.", "Drink warm liquids like tea with honey or broth.", "Use throat lozenges or sprays.", "Rest your voice.", "Avoid irritants like smoke or pollution.", "A humidifier can help soothe a dry throat.", "If symptoms are severe or persist, see a doctor."],
    "context_set": ""
  },
    {
    "tag": "earache",
    "patterns": ["What helps with an earache?", "How to relieve ear pain?", "What are good remedies for earaches?", "How to treat an ear infection?", "What can I take for earache relief?", "Any tips for managing ear pain?", "How to prevent earaches?"],
    "responses": ["Apply a warm compress to the affected ear.", "Over-the-counter pain relievers can help manage pain.", "Avoid inserting anything into the ear canal.", "Chewing gum or sucking on hard candy can sometimes relieve pressure.", "See a doctor if pain is severe or accompanied by fever or discharge.", "Dry your ears thoroughly after swimming or showering.", "Avoid exposure to secondhand smoke."],
    "context_set": ""
  },
  제공해주신 형식을 참고하여 대학생들이 쉽게 겪는 학업 문제들을 영어 tag명으로 구성하여 JSON 형식으로 만들어 보았습니다. 한국어 버전과 마찬가지로, 대학생들의 문제는 개인차가 크고 복합적인 요인이 작용할 수 있다는 점을 고려하여 일반적인 경향을 반영하였습니다.
JSON

[
  {
    "tag": "major_adjustment_difficulties",
    "patterns": ["I don't think my major is right for me.", "My major is too difficult.", "I'm having trouble keeping up with my major courses.", "I think I made the wrong choice with my major.", "I'm not interested in my major.", "My major is stressing me out.", "Should I change my major?"],
    "responses": ["Have you considered getting career counseling related to your major?", "Try using tutoring or study groups for your major courses.", "You can try auditing other major courses to compare.", "You can seek advice by consulting with professors or seniors.", "Participate in various activities related to your major.", "Consider taking a leave of absence or double majoring/minoring.", "Take some time to think about your strengths and interests again."],
    "context_set": ""
  },
  {
    "tag": "academic_anxiety_and_stress",
    "patterns": ["I'm so anxious about exams.", "I'm stressed about my grades.", "I'm overwhelmed with assignments.", "I can't concentrate on my studies.", "I'm struggling with anxiety about the future.", "I think I'm burned out.", "I'm having trouble balancing academics and other activities."],
    "responses": ["Try using the school counseling center.", "Maintaining a regular daily routine is important.", "Relieve stress through proper rest and hobbies.", "Talk comfortably with friends or family.", "Try activities that help stabilize your mind and body, such as meditation or yoga.", "Create and follow a time management plan.", "Try to think positively."],
    "context_set": ""
  },
  {
    "tag": "time_management_difficulties",
    "patterns": ["I have poor time management skills.", "I often miss assignment deadlines.", "I have trouble managing my class schedule.", "I make plans but can't keep them.", "I have so many things to do that I don't know where to start.", "I feel constantly rushed.", "I don't know how to use my time efficiently."],
    "responses": ["Try using a scheduler or planner.", "Use time management apps or websites.", "Utilize time management techniques such as the Pomodoro Technique.", "Prioritize and handle important tasks first.", "Ask for help or advice from people around you.", "Organize your workspace and create a focused environment.", "Get enough sleep."],
    "context_set": ""
  },
  {
    "tag": "interpersonal_relationship_difficulties",
    "patterns": ["I have trouble making friends at school.", "I have conflicts in team projects.", "I have a difficult relationship with my professors.", "I'm very shy and it's hard.", "I have trouble communicating with others.", "I spend a lot of time alone.", "It's difficult for me to be proactive."],
    "responses": ["Try joining school clubs or study groups.", "Actively participate in departmental events or orientation.", "Participate in the counseling center's interpersonal relationship programs.", "Try talking to others first.", "Have an attitude of listening to the other person.", "Utilize online communities.", "Try to act proactively with confidence."],
    "context_set": ""
  },
  {
    "tag": "financial_difficulties",
    "patterns": ["It's too hard to pay tuition.", "I don't have enough living expenses.", "I don't have enough time to study because of my part-time job.", "It's difficult to balance academics and part-time work.", "I don't have enough allowance.", "I'm stressed because of financial problems.", "It's hard to get scholarship information."],
    "responses": ["Look for school scholarship programs and external scholarship information.", "Utilize on-campus part-time jobs or work-study programs.", "Learn about student loan programs offered by the government or local governments.", "Find ways to save on living expenses.", "Ask for help from family or acquaintances.", "Getting financial counseling can also be helpful.", "Adjust your part-time work hours so that it doesn't interfere with your studies."],
    "context_set": ""
  },
  {
    "tag": "career_concerns",
    "patterns": ["I don't know what to do in the future.", "I'm worried about my career after graduation.", "I'm worried about what job I should get.", "I don't know what I want to do.", "It's hard to find a job related to my major.", "I have no confidence in the future.", "I don't know how to prepare for a job."],
    "responses": ["Visit the school's career support center for counseling.", "Participate in career-related lectures or special lectures.", "Look for various job information.", "Gain experience through internships or volunteer work.", "Seek advice from seniors or graduates.", "Take time to explore yourself.", "Meet people in related fields and build a network."],
    "context_set": ""
  },
  {
    "tag": "learning_method_difficulties",
    "patterns": ["I don't know how to study.", "I have trouble memorizing.", "I have difficulty understanding the course content.", "My grades don't improve even if I try.", "I have poor concentration and can't study.", "I don't know how to study effectively for exams.", "I have no motivation to study."],
    "responses": ["Find a learning method that suits you (e.g., visual, auditory, kinesthetic learning).", "Improve your note-taking methods.", "Use study groups to teach and learn from each other.", "Utilize online learning resources or educational platforms.", "Use various learning techniques (e.g., summarizing, mind mapping).", "Create a study schedule and stick to it.", "Set specific and achievable study goals."],
    "context_set": ""
  },
]
}
